1C/InformationRegisters/НВК_НастройкиСетевогоДвижка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НВК_НастройкиСетевогоДвижка</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МаксСтрокОчереди</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТаймаутЗапросаСек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИгнорироватьОшибкиSSL</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКСертификатуCA</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьККлиентскомуСертификату</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКПриватномуКлючу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1C/CommonModules/НВК_НастройкиСетевогоДвижка/Ext/Module.bsl
// Возвращает стандартные настройки соединения.
//
// Возвращаемое значение:
//   Структура:
//     * max_rows - Число - максимальное количество строк
//     * secs_timeouts - Число - таймаут в секундах
//     * danger_accept_invalid_certs - Булево - разрешение недействительных сертификатов
//     * ca_cert_path - Строка, Неопределено - путь к сертификату CA
//     * client_cert_path - Строка, Неопределено - путь к клиентскому сертификату
//     * client_key_path - Строка, Неопределено - путь к ключу клиента
Функция ПолучитьСтандартныеНастройки() Экспорт
	Настройки = Новый Структура;
	Настройки.Вставить("max_rows", 1000);
	Настройки.Вставить("secs_timeouts", 30);
	Настройки.Вставить("danger_accept_invalid_certs", Истина);
	Настройки.Вставить("ca_cert_path",     Неопределено);
    Настройки.Вставить("client_cert_path", Неопределено);
    Настройки.Вставить("client_key_path",  Неопределено);
	Возврат Настройки;
КонецФункции

// Возвращает текущие настройки сетевого движка из регистра сведений. Если регистр пуст, возвращает стандартные настройки.
//
// Возвращаемое значение:
//   Структура:
//     * max_rows - Число - максимальное количество строк в очереди (по умолчанию 1000)
//     * secs_timeouts - Число - таймаут запроса в секундах (по умолчанию 30)
//     * danger_accept_invalid_certs - Булево - игнорировать ошибки SSL
//     * ca_cert_path - Строка - путь к сертификату CA
//                    - Неопределено - если путь не задан
//     * client_cert_path - Строка - путь к клиентскому сертификату
//                        - Неопределено - если путь не задан
//     * client_key_path - Строка - путь к приватному ключу
//                       - Неопределено - если путь не задан
Функция ПолучитьТекущиеНастройки() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	НВК_НастройкиСетевогоДвижка.МаксСтрокОчереди КАК max_rows,
	|	НВК_НастройкиСетевогоДвижка.ТаймаутЗапросаСек КАК secs_timeouts,
	|	НВК_НастройкиСетевогоДвижка.ИгнорироватьОшибкиSSL КАК danger_accept_invalid_certs,
	|	НВК_НастройкиСетевогоДвижка.ПутьКСертификатуCA КАК ca_cert_path,
	|	НВК_НастройкиСетевогоДвижка.ПутьККлиентскомуСертификату КАК client_cert_path,
	|	НВК_НастройкиСетевогоДвижка.ПутьКПриватномуКлючу КАК client_key_path
	|ИЗ
	|	РегистрСведений.НВК_НастройкиСетевогоДвижка КАК НВК_НастройкиСетевогоДвижка";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ПолучитьСтандартныеНастройки();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Настройки = Новый Структура;
	
	Настройки.Вставить("max_rows", ?(Выборка.max_rows = 0, 1000, Выборка.max_rows));
    Настройки.Вставить("secs_timeouts", ?(Выборка.secs_timeouts = 0, 30, Выборка.secs_timeouts));
    Настройки.Вставить("danger_accept_invalid_certs", Выборка.danger_accept_invalid_certs);
    Настройки.Вставить("ca_cert_path",     ?(ЗначениеЗаполнено(Выборка.ca_cert_path),     СокрЛП(Выборка.ca_cert_path),     Неопределено));
    Настройки.Вставить("client_cert_path", ?(ЗначениеЗаполнено(Выборка.client_cert_path), СокрЛП(Выборка.client_cert_path), Неопределено));
    Настройки.Вставить("client_key_path",  ?(ЗначениеЗаполнено(Выборка.client_key_path),  СокрЛП(Выборка.client_key_path),  Неопределено));
	
	Возврат Настройки;
КонецФункции

// Настраивает движок внешней компоненты Rust с текущими настройками. При ошибке сериализации применяет стандартные настройки.
//
// Параметры:
//   ВК - Объект - объект внешней компоненты для настройки
//
// Возвращаемое значение:
//   Булево - Истина, если движок успешно настроен, Ложь в противном случае
Функция ИнициализироватьДвижокВRust(ВК) Экспорт
	ИмяСобытияЖР = "НВК_НастройкаДвижка";
	
	Если ВК = Неопределено Тогда
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,,"Не удалось настроить Rust: Передан пустой объект внешней компоненты.");
		Возврат Ложь;
	КонецЕсли;
	
	ТекущиеНастройки = ПолучитьТекущиеНастройки();
	
	СтрокаНастроекJSON = НВК_Сериализация.ДанныеВСтрокуJSON(ТекущиеНастройки);
	
	Если НЕ ЗначениеЗаполнено(СтрокаНастроекJSON) Тогда
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Предупреждение,,,"Сбой сериализации текущих настроек! Применяем аварийные стандартные настройки.");
		СтандартныеНастройки = ПолучитьСтандартныеНастройки();
		СтрокаНастроекJSON = НВК_Сериализация.ДанныеВСтрокуJSON(СтандартныеНастройки);
	КонецЕсли;
	
	Попытка
		УспешноНастроено = ВК.Настроить(СтрокаНастроекJSON);
	Исключение
		УспешноНастроено = Ложь;
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,,"Исключение при вызове метода ВК.Настроить(): " + ОписаниеОшибки());
		ЗаписьЖурналаРегистрации(ИмяСобытияЖР, УровеньЖурналаРегистрации.Ошибка,,, 
            "Внешняя компонента вернула Ложь на метод Настроить(). Внутренний рантайм Rust не запущен.");
	КонецПопытки;
	Возврат УспешноНастроено;
КонецФункции
